#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_organizations_policy_attachment.bca: Refreshing state... [id=r-sxxy:p-wabgkbdu]
aws_organizations_policy.pesr: Refreshing state... [id=p-umd3bc18]
aws_organizations_policy_attachment.dsous: Refreshing state... [id=r-sxxy:p-qjsnvbjo]
aws_organizations_policy_attachment.root: Refreshing state... [id=r-sxxy:p-umd3bc18]
aws_organizations_policy.bca: Refreshing state... [id=p-wabgkbdu]
aws_organizations_policy.dsous: Refreshing state... [id=p-qjsnvbjo]
aws_organizations_policy_attachment.bcca: Refreshing state... [id=r-sxxy:p-apdd4ehh]
aws_organizations_policy.tmp: Refreshing state... [id=p-zurpphii]
aws_organizations_policy.bcca: Refreshing state... [id=p-apdd4ehh]
data.aws_organizations_organization.root: Reading...
aws_organizations_organization.root: Refreshing state... [id=o-i66z0agv26]
data.aws_organizations_organization.root: Read complete after 0s [id=o-i66z0agv26]
aws_organizations_organizational_unit.active["bu2"]: Refreshing state... [id=ou-sxxy-hrgk30a5]
aws_organizations_organizational_unit.trash: Refreshing state... [id=ou-sxxy-9wg28p0c]
aws_organizations_organizational_unit.active["bu1"]: Refreshing state... [id=ou-sxxy-6if22zfs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_organizations_policy.allow_list will be created
  + resource "aws_organizations_policy" "allow_list" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "organizations:ListPoliciesForTarget",
                          + "organizations:ListTargetsForPolicy",
                          + "organizations:DescribeEffectivePolicy",
                          + "organizations:DescribePolicy",
                          + "organizations:ListRoots",
                          + "organizations:DisableAWSServiceAccess",
                          + "organizations:DetachPolicy",
                          + "organizations:DeletePolicy",
                          + "organizations:DescribeAccount",
                          + "organizations:DisablePolicyType",
                          + "organizations:ListAWSServiceAccessForOrganization",
                          + "organizations:ListPolicies",
                          + "organizations:ListAccountsForParent",
                          + "organizations:ListAccounts",
                          + "organizations:EnableAWSServiceAccess",
                          + "organizations:ListCreateAccountStatus",
                          + "organizations:DescribeOrganization",
                          + "organizations:UpdatePolicy",
                          + "organizations:EnablePolicyType",
                          + "organizations:DescribeOrganizationalUnit",
                          + "organizations:AttachPolicy",
                          + "organizations:ListParents",
                          + "organizations:ListOrganizationalUnitsForParent",
                          + "organizations:CreatePolicy",
                          + "organizations:DescribeCreateAccountStatus",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageTagPolicies"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Allow actions"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.bca will be destroyed
  # (because aws_organizations_policy.bca is not in configuration)
  - resource "aws_organizations_policy" "bca" {
      - arn      = "arn:aws:organizations::543863199176:policy/o-i66z0agv26/service_control_policy/p-wabgkbdu" -> null
      - content  = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "config:DeleteConfigRule",
                          - "config:DeleteConfigurationRecorder",
                          - "config:DeleteDeliveryChannel",
                          - "config:StopConfigurationRecorder",
                        ]
                      - Effect   = "Deny"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id       = "p-wabgkbdu" -> null
      - name     = "Block AWS Config Actions" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - type     = "SERVICE_CONTROL_POLICY" -> null
    }

  # aws_organizations_policy.bcca will be destroyed
  # (because aws_organizations_policy.bcca is not in configuration)
  - resource "aws_organizations_policy" "bcca" {
      - arn      = "arn:aws:organizations::543863199176:policy/o-i66z0agv26/service_control_policy/p-apdd4ehh" -> null
      - content  = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudtrail:AddTags",
                          - "cloudtrail:CreateTrail",
                          - "cloudtrail:DeleteTrail",
                          - "cloudtrail:RemoveTags",
                          - "cloudtrail:StartLogging",
                          - "cloudtrail:StopLogging",
                          - "cloudtrail:UpdateTrail",
                        ]
                      - Effect   = "Deny"
                      - Resource = [
                          - "*",
                        ]
                      - Sid      = "Stmt1234567890123"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id       = "p-apdd4ehh" -> null
      - name     = "Block CloudTrail Configuration Actions" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - type     = "SERVICE_CONTROL_POLICY" -> null
    }

  # aws_organizations_policy.deny_list will be created
  + resource "aws_organizations_policy" "deny_list" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudtrail:AddTags",
                          + "cloudtrail:CreateTrail",
                          + "cloudtrail:DeleteTrail",
                          + "cloudtrail:RemoveTags",
                          + "cloudtrail:StartLogging",
                          + "cloudtrail:StopLogging",
                          + "cloudtrail:UpdateTrail",
                          + "config:DeleteConfigRule",
                          + "config:DeleteConfigurationRecorder",
                          + "config:DeleteDeliveryChannel",
                          + "config:StopConfigurationRecorder",
                        ]
                      + Effect   = "DenyConfigChanges"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "ram:CreateResourceShare",
                          + "ram:UpdateResourceShare",
                        ]
                      + Condition = {
                          + Bool = {
                              + "ram:RequestedAllowsExternalPrincipals" = "true"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "*"
                      + Sid       = "DenyExternalSharing"
                    },
                  + {
                      + Condition = {
                          + StringNotEquals = {
                              + "aws:RequestedRegion" = [
                                  + "af-*",
                                  + "ap-*",
                                  + "ca-*",
                                  + "eu-*",
                                  + "me-*",
                                  + "sa-*",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + NotAction = [
                          + "a4b:*",
                          + "acm:*",
                          + "aws-marketplace-management:*",
                          + "aws-marketplace:*",
                          + "aws-portal:*",
                          + "budgets:*",
                          + "ce:*",
                          + "chime:*",
                          + "cloudfront:*",
                          + "config:*",
                          + "cur:*",
                          + "directconnect:*",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeTransitGateways",
                          + "ec2:DescribeVpnGateways",
                          + "fms:*",
                          + "globalaccelerator:*",
                          + "health:*",
                          + "iam:*",
                          + "importexport:*",
                          + "kms:*",
                          + "mobileanalytics:*",
                          + "networkmanager:*",
                          + "organizations:*",
                          + "pricing:*",
                          + "route53:*",
                          + "route53domains:*",
                          + "s3:GetAccountPublic*",
                          + "s3:ListAllMyBuckets",
                          + "s3:PutAccountPublic*",
                          + "shield:*",
                          + "sts:*",
                          + "support:*",
                          + "trustedadvisor:*",
                          + "waf-regional:*",
                          + "waf:*",
                          + "wafv2:*",
                          + "wellarchitected:*",
                        ]
                      + Resource  = "*"
                      + Sid       = "DenyAllOutsideUS"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Deny actions"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy.dsous will be destroyed
  # (because aws_organizations_policy.dsous is not in configuration)
  - resource "aws_organizations_policy" "dsous" {
      - arn      = "arn:aws:organizations::543863199176:policy/o-i66z0agv26/service_control_policy/p-qjsnvbjo" -> null
      - content  = jsonencode(
            {
              - Statement = [
                  - {
                      - Condition = {
                          - StringNotEquals = {
                              - "aws:RequestedRegion" = [
                                  - "af-*",
                                  - "ap-*",
                                  - "ca-*",
                                  - "eu-*",
                                  - "me-*",
                                  - "sa-*",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - NotAction = [
                          - "a4b:*",
                          - "acm:*",
                          - "aws-marketplace-management:*",
                          - "aws-marketplace:*",
                          - "aws-portal:*",
                          - "budgets:*",
                          - "ce:*",
                          - "chime:*",
                          - "cloudfront:*",
                          - "config:*",
                          - "cur:*",
                          - "directconnect:*",
                          - "ec2:DescribeRegions",
                          - "ec2:DescribeTransitGateways",
                          - "ec2:DescribeVpnGateways",
                          - "fms:*",
                          - "globalaccelerator:*",
                          - "health:*",
                          - "iam:*",
                          - "importexport:*",
                          - "kms:*",
                          - "mobileanalytics:*",
                          - "networkmanager:*",
                          - "organizations:*",
                          - "pricing:*",
                          - "route53:*",
                          - "route53domains:*",
                          - "s3:GetAccountPublic*",
                          - "s3:ListAllMyBuckets",
                          - "s3:PutAccountPublic*",
                          - "shield:*",
                          - "sts:*",
                          - "support:*",
                          - "trustedadvisor:*",
                          - "waf-regional:*",
                          - "waf:*",
                          - "wafv2:*",
                          - "wellarchitected:*",
                        ]
                      - Resource  = "*"
                      - Sid       = "DenyAllOutsideUS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id       = "p-qjsnvbjo" -> null
      - name     = "Deny Services Outside US" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - type     = "SERVICE_CONTROL_POLICY" -> null
    }

  # aws_organizations_policy.pesr will be destroyed
  # (because aws_organizations_policy.pesr is not in configuration)
  - resource "aws_organizations_policy" "pesr" {
      - arn      = "arn:aws:organizations::543863199176:policy/o-i66z0agv26/service_control_policy/p-umd3bc18" -> null
      - content  = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ram:CreateResourceShare",
                          - "ram:UpdateResourceShare",
                        ]
                      - Condition = {
                          - Bool = {
                              - "ram:RequestedAllowsExternalPrincipals" = "true"
                            }
                        }
                      - Effect    = "Deny"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id       = "p-umd3bc18" -> null
      - name     = "Preventing External Sharing of Resources" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - type     = "SERVICE_CONTROL_POLICY" -> null
    }

  # aws_organizations_policy.tmp will be destroyed
  # (because aws_organizations_policy.tmp is not in configuration)
  - resource "aws_organizations_policy" "tmp" {
      - arn      = "arn:aws:organizations::543863199176:policy/o-i66z0agv26/service_control_policy/p-zurpphii" -> null
      - content  = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "organizations:ListPoliciesForTarget",
                          - "organizations:ListTargetsForPolicy",
                          - "organizations:DescribeEffectivePolicy",
                          - "organizations:DescribePolicy",
                          - "organizations:ListRoots",
                          - "organizations:DisableAWSServiceAccess",
                          - "organizations:DetachPolicy",
                          - "organizations:DeletePolicy",
                          - "organizations:DescribeAccount",
                          - "organizations:DisablePolicyType",
                          - "organizations:ListAWSServiceAccessForOrganization",
                          - "organizations:ListPolicies",
                          - "organizations:ListAccountsForParent",
                          - "organizations:ListAccounts",
                          - "organizations:EnableAWSServiceAccess",
                          - "organizations:ListCreateAccountStatus",
                          - "organizations:DescribeOrganization",
                          - "organizations:UpdatePolicy",
                          - "organizations:EnablePolicyType",
                          - "organizations:DescribeOrganizationalUnit",
                          - "organizations:AttachPolicy",
                          - "organizations:ListParents",
                          - "organizations:ListOrganizationalUnitsForParent",
                          - "organizations:CreatePolicy",
                          - "organizations:DescribeCreateAccountStatus",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ManageTagPolicies"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - id       = "p-zurpphii" -> null
      - name     = "Tag Management Policy" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - type     = "SERVICE_CONTROL_POLICY" -> null
    }

  # aws_organizations_policy_attachment.allow_list will be created
  + resource "aws_organizations_policy_attachment" "allow_list" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "r-sxxy"
    }

  # aws_organizations_policy_attachment.bca will be destroyed
  # (because aws_organizations_policy_attachment.bca is not in configuration)
  - resource "aws_organizations_policy_attachment" "bca" {
      - id        = "r-sxxy:p-wabgkbdu" -> null
      - policy_id = "p-wabgkbdu" -> null
      - target_id = "r-sxxy" -> null
    }

  # aws_organizations_policy_attachment.bcca will be destroyed
  # (because aws_organizations_policy_attachment.bcca is not in configuration)
  - resource "aws_organizations_policy_attachment" "bcca" {
      - id        = "r-sxxy:p-apdd4ehh" -> null
      - policy_id = "p-apdd4ehh" -> null
      - target_id = "r-sxxy" -> null
    }

  # aws_organizations_policy_attachment.deny_list will be created
  + resource "aws_organizations_policy_attachment" "deny_list" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "r-sxxy"
    }

  # aws_organizations_policy_attachment.dsous will be destroyed
  # (because aws_organizations_policy_attachment.dsous is not in configuration)
  - resource "aws_organizations_policy_attachment" "dsous" {
      - id        = "r-sxxy:p-qjsnvbjo" -> null
      - policy_id = "p-qjsnvbjo" -> null
      - target_id = "r-sxxy" -> null
    }

  # aws_organizations_policy_attachment.root will be destroyed
  # (because aws_organizations_policy_attachment.root is not in configuration)
  - resource "aws_organizations_policy_attachment" "root" {
      - id        = "r-sxxy:p-umd3bc18" -> null
      - policy_id = "p-umd3bc18" -> null
      - target_id = "r-sxxy" -> null
    }

Plan: 4 to add, 0 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ricardo-f, Action: `pull_request`, Working Directory: ``, Workflow: `Account Creation`*